IDENTIFICATION DIVISION.
PROGRAM-ID. TESTFOUR.
ENVIRONMENT DIVISION
INPUT-OUTPUT SECTION.
FILE-CONTROL
SELECT WORKINGFILE assign to 'file.txt'
ORGANIZATION IS LINE SEQUENTIAL
DATA DIVISION.
FILE SECTION.
FD WORKINGFILE.
01 FILEDATA PIC PIC X(128).
PROCEDURE DIVISION.
	OPEN INPUT WORKINGFILE
	PERFORM UNTIL EOF
		READ WORKINGFILE
			AT END MOVE 'Y' TO W
